yepher/livekit-esp-demos/02-bsp-deep-dive/code/sdkconfig.defaults.example
CONFIG_IDF_TARGET="esp32s3"

# --- WiFi credentials ---
# Set these to your local network SSID and password.
CONFIG_LK_EXAMPLE_USE_WIFI=y
CONFIG_LK_EXAMPLE_WIFI_SSID="your-wifi"
CONFIG_LK_EXAMPLE_WIFI_PASSWORD="your-password"

# --- LiveKit credentials ---
# Option A: Python helper script (recommended).
#   Put LIVEKIT_API_KEY, LIVEKIT_API_SECRET, LIVEKIT_URL in ./env (or env vars),
#   then from this directory run:  python ../../tools/make_test_token.py
#   Copy the printed "sdkconfig.defaults" block here (it comments out sandbox
#   and fills SERVER_URL and TOKEN). Use the User join URL to join the room.
# Option B: Sandbox.
#   Uncomment USE_SANDBOX and SANDBOX_ID below; the device will request a
#   short-lived token automatically. Get a Sandbox ID from https://cloud.livekit.io
# CONFIG_LK_EXAMPLE_USE_SANDBOX=y
# CONFIG_LK_EXAMPLE_SANDBOX_ID="your-sandbox-id"
# CONFIG_LK_EXAMPLE_USE_PREGENERATED=y
# CONFIG_LK_EXAMPLE_SERVER_URL="wss://your-project.livekit.cloud"
# CONFIG_LK_EXAMPLE_TOKEN="<paste ESP32 token from make_test_token.py>"

# --- Waveshare ESP32-S3-Touch-LCD-1.83 board settings ---
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=85

# --- BSP overrides ---
# The Waveshare BSP defaults I2C and I2S to peripheral 1. Override to 0 so
# we match Post 01's configuration. Either port works on this board, but being
# explicit avoids surprises when mixing BSP and non-BSP code.
CONFIG_BSP_I2C_NUM=0
CONFIG_BSP_I2S_NUM=0

# --- Performance ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# --- PSRAM (8 MB octal) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Flash (16 MB QIO) ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Cache ---
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- TLS / WebRTC ---
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# --- WebSocket ---
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# --- SNTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- Experimental features (required by some components) ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
